A Web Browser Password Viewer executed on the infected machine. What is the name of the binary? Enter the full path.
- Serach for "web Browser Password viewer"

What is listed as the company name?
- Search for company field. 

Another suspicious binary running from the same folder was executed on the workstation. What was the name of the binary? What is listed as its original filename? (format: file.xyz,file.xyz)
- Search using sysmon event id 1 C:\Users\Finance01\AppData\Local\Temp\IonicLarge.exe

The binary from the previous question made two outbound connections to a malicious IP address. What was the IP address? Enter the answer in a defang format.
Search for sysmon event id 3 once we have the name of the binary.
- - index=* ioniclarge.exe EventCode=3 


The same binary made some change to a registry key. What was the key path?
- index=* ioniclarge.exe EventCode=13 | table  _time TargetObject

Some processes were killed and the associated binaries were deleted. What were the names of the two binaries? (format: file.xyz,file.xyz)
- index=* taskkill | table _time CommandLine ParentCommandLine


The attacker ran several commands within a PowerShell session to change the behaviour of Windows Defender. What was the last command executed in the series of similar commands?
- Can get the powershell command via searching for sysmon event ID 1 with "temp"
CommandLine="\"C:\\Windows\\System32\\cmd.exe\" /C forfiles /p c:\\windows\\system32 /m waitfor.exe /c \"cmd /C powershell WMIC /NAMESPACE:\\\\root\\Microsoft\\Windows\\Defender PATH MSFT_MpPreference call Add ThreatIDDefaultAction_Ids=2147735503 ThreatIDDefaultAction_Actions=6 Force=True\" & forfiles /p c:\\windows\\system32 /m where.exe /c \"cmd /C powershell WMIC /NAMESPACE:\\\\root\\Microsoft\\Windows\\Defender PATH MSFT_MpPreference call Add ThreatIDDefaultAction_Ids=2147737010 ThreatIDDefaultAction_Actions=6 Force=True\" & forfiles /p c:\\windows\\system32 /m calc.exe /c \"cmd /C powershell WMIC /NAMESPACE:\\\\root\\Microsoft\\Windows\\Defender PATH MSFT_MpPreference call Add ThreatIDDefaultAction_Ids=2147737007 ThreatIDDefaultAction_Actions=6 Force=True\" & forfiles /p c:\\windows\\system32 /m notepad.exe /c \"cmd /C powershell WMIC /NAMESPACE:\\\\root\\Microsoft\\Windows\\Defender PATH MSFT_MpPreference call Add ThreatIDDefaultAction_Ids=2147737394 ThreatIDDefaultAction_Actions=6 Force=True\" &"

Based on the previous answer, what were the four IDs set by the attacker? Enter the answer in order of execution. (format: 1st,2nd,3rd,4th)
- Refer to command above.


Another malicious binary was executed on the infected workstation from another AppData location. What was the full path to the binary?
- Search for appdata folder that is different from original location.

What were the DLLs that were loaded from the binary from the previous question? Enter the answers in alphabetical order. (format: file1.dll,file2.dll,file3.dll)
- Look for the field ImageLoaded.


username: DESKTOP-H1ATIJC\Finance01
hostname: DESKTOP-H1ATIJC

"C:\Users\Finance01\Desktop\Procmon.exe"
C:\Users\FINANC~1\AppData\Local\Temp\Procmon64.exe

"C:\Users\Finance01\AppData\Local\Temp\IonicLarge.exe"


powershell WMIC /NAMESPACE:\\root\Microsoft\Windows\Defender PATH MSFT_MpPreference call Add ThreatIDDefaultAction_Ids=2147737394 ThreatIDDefaultAction_Actions=6 Force=True\" &"





CommandLine="\"C:\\Windows\\System32\\cmd.exe\" /C forfiles /p c:\\windows\\system32 /m waitfor.exe /c \"cmd /C powershell WMIC /NAMESPACE:\\\\root\\Microsoft\\Windows\\Defender PATH MSFT_MpPreference call Add ThreatIDDefaultAction_Ids=2147735503 ThreatIDDefaultAction_Actions=6 Force=True\" & forfiles /p c:\\windows\\system32 /m where.exe /c \"cmd /C powershell WMIC /NAMESPACE:\\\\root\\Microsoft\\Windows\\Defender PATH MSFT_MpPreference call Add ThreatIDDefaultAction_Ids=2147737010 ThreatIDDefaultAction_Actions=6 Force=True\" & forfiles /p c:\\windows\\system32 /m calc.exe /c \"cmd /C powershell WMIC /NAMESPACE:\\\\root\\Microsoft\\Windows\\Defender PATH MSFT_MpPreference call Add ThreatIDDefaultAction_Ids=2147737007 ThreatIDDefaultAction_Actions=6 Force=True\" & forfiles /p c:\\windows\\system32 /m notepad.exe /c \"cmd /C powershell WMIC /NAMESPACE:\\\\root\\Microsoft\\Windows\\Defender PATH MSFT_MpPreference call Add ThreatIDDefaultAction_Ids=2147737394 ThreatIDDefaultAction_Actions=6 Force=True\" &"