1. This is a simple question to get you familiar with submitting answers. What is the name of the company that makes the software that you are using for this competition? Just a six-letter word with no punctuation.
Splunk

2. What is the likely IP address of someone from the Po1s0n1vy group scanning imreallynotbatman.com for web application vulnerabilities?
- Review all data available first 
| metadata type=sourcetypes index=botsv1
index=botsv1 imreallynotbatman.com
index=botsv1 imreallynotbatman.com sourcetype=stream:http
index=botsv1 imreallynotbatman.com src=40.80.148.42 sourcetype=suricata | stats count by signature

3. What company created the web vulnerability scanner used by Po1s0n1vy? Type the company name. (For example "Microsoft" or "Oracle")
index=botsv1 src=40.80.148.42 sourcetype=stream:http | stats count by src_headers
index=botsv1 src=40.80.148.42 sourcetype=stream:http | stats count by http_user_agent

4. What content management system is imreallynotbatman.com likely using?(Please do not include punctuation such as . , ! ? in your answer. We are looking for alpha characters only.)
index=botsv1 src=40.80.148.42 sourcetype=stream:http | stats count by uri

5. What is the name of the file that defaced the imreallynotbatman.com website? Please submit only the name of the file with extension (For example "notepad.exe" or "favicon.ico").
Find outgoing traffic from server.
index=botsv1 src=192.168.250.70 sourcetype=stream:http | stats count by url


6. This attack used dynamic DNS to resolve to the malicious IP. What fully qualified domain name (FQDN) is associated with this attack?
index=botsv1 src=192.168.250.70 sourcetype=stream:http | stats count by site

7. What IP address has Po1s0n1vy tied to domains that are pre-staged to attack Wayne Enterprises?
index=botsv1 src=192.168.250.70 sourcetype=stream:http | table url site dest

8. Based on the data gathered from this attack and common open source intelligence sources for domain names, what is the email address that is most likely associated with Po1s0n1vy APT group?
https://threatcrowd.org/ip.php?ip=23.22.63.114

9. What IP address is likely attempting a brute force password attack against imreallynotbatman.com?
index=botsv1 sourcetype=stream:http dest="192.168.250.70" http_method=POST
index=botsv1 sourcetype=stream:http dest="192.168.250.70" http_method=POST form_data=*username*passwd* | table form_data
index=botsv1 sourcetype=stream:http dest="192.168.250.70" http_method=POST form_data=*username*passwd* | stats values(form_data) by src_ip

10. What is the name of the executable uploaded by Po1s0n1vy? Please include file extension. (For example, "notepad.exe" or "favicon.ico")
index=botsv1 sourcetype=stream:http dest="192.168.250.70" *.exe
index=botsv1 sourcetype=suricata dest_ip=192.168.250.70 .exe
index=botsv1 sourcetype=suricata dest_ip="192.168.250.70" http.http_method=POST .exe

11. What is the MD5 hash of the executable uploaded?
index=botsv1 3791.exe sourcetype=XmlWinEventLog:Microsoft-Windows-Sysmon/Operational Image="C:\\inetpub\\wwwroot\\joomla\\3791.exe" EventCode=1 |  table CommandLine ParentCommandLine Image


12. GCPD reported that common TTPs (Tactics, Techniques, Procedures) for the Po1s0n1vy APT group, if initial compromise fails, is to send a spear phishing email with custom malware attached to their intended target. This malware is usually connected to Po1s0n1vys initial attack infrastructure. Using research techniques, provide the SHA256 hash of this malware.
9709473ab351387aab9e816eff3910b9f28a7a70202e250ed46dba8f820f34a8 

13. What special hex code is associated with the customized malware discussed in question 12? (Hint: It's not in Splunk)
Check on virustotal

14. One of Po1s0n1vy's staged domains has some disjointed "unique" whois information. Concatenate the two codes together and submit as a single answer.

15. What was the first brute force password used?
index=botsv1 sourcetype=stream:http form_data=*username*passwd* dest_ip="192.168.250.70" | table _time form_data | sort _time

16. One of the passwords in the brute force attack is James Brodsky's favorite Coldplay song. Hint: we are looking for a six character word on this one. Which is it?
index=botsv1 sourcetype=stream:http form_data=*username*passwd* | rex field=form_data "passwd=(?<userpassword>\w+)"
| eval lenpword=len(userpassword)
| search lenpword=6
| table lenpword userpassword

17. What was the correct password for admin access to the content management system running "imreallynotbatman.com"?
index=botsv1 sourcetype=stream:http form_data=*username*passwd* | rex field=form_data "passwd=(?<userpassword>\w+)"
| stats count by userpassword
*Upon discovering a seemingly correct password, a password brute-forcing engine such as hydra will enter the password a second time to verify that it works. 


18. What was the average password length used in the password brute forcing attempt? (Round to closest whole integer. For example "5" not "5.23213")
index="botsv1" sourcetype="stream:http" dest=192.168.250.70 http_method=POST form_data=*user*pass* | stats count by src
index="botsv1" sourcetype="stream:http" dest=192.168.250.70 http_method=POST form_data=*user*pass* | rex field=form_data "passwd=(?<userpassword>\w+)" | eval lenpword=len(userpassword) | stats avg(lenpword) AS avgPword | eval avgPword=round(avgPword,0)
OR
index=botsv1 sourcetype=stream:http form_data=*username*passwd* | rex field=form_data "passwd=(?<userpassword>\w+)"
| eval lenpword=len(userpassword)
| stats avg(lenpword)

19. How many seconds elapsed between the time the brute force password scan identified the correct password and the compromised login? Round to 2 decimal places.
index="botsv1" sourcetype="stream:http" dest=192.168.250.70 http_method=POST form_data=*user*pass* | rex field=form_data "passwd=(?<userpassword>\w+)" | search userpassword=batman | transaction userpassword | table duration


20. How many unique passwords were attempted in the brute force attempt?
index=botsv1 sourcetype=stream:http form_data=*username*passwd*  | rex field=form_data "passwd=(?<userpassword>\w+)" | stats dc(userpassword)
OR
index=botsv1 sourcetype=stream:http form_data=*username*passwd*  | rex field=form_data "passwd=(?<userpassword>\w+)" | dedup userpassword

21. What was the most likely IP address of we8105desk on 24AUG2016?
index=botsv1 we8105desk sourcetype=XmlWinEventLog:Microsoft-Windows-Sysmon/Operational

22. Amongst the Suricata signatures that detected the Cerber malware, which one alerted the fewest number of times? Submit ONLY the signature ID value as the answer. (No punctuation, just 7 integers.)
index="botsv1" sourcetype="suricata" cerber
| stats count by signature

23. What fully qualified domain name (FQDN) does the Cerber ransomware attempt to direct the user to at the end of its encryption phase?
index=botsv1 sourcetype=stream:DNS src=192.168.250.100 record_type=A NOT (query{}=*.microsoft.com OR query{}=*.waynecorpinc.local OR query{}=*.bing.com OR query{}=isatap OR query{}=wpad OR query{}=*.windows.com OR query{}=*.msftncsi.com) | table _time query{} src dest

24. What was the first suspicious domain visited by we8105desk on 24AUG2016?
index="botsv1" sourcetype="suricata" src_ip=192.168.250.100 event_type=http 
| stats count by http.hostname

25. During the initial Cerber infection a VB script is run. The entire script from this execution, pre-pended by the name of the launching .exe, can be found in a field in Splunk. What is the length in characters of the value of this field?
Use the malicious exe file found as a ParentCommandLine. This will help find the malicious exe file(the name is miranda_tate_unveiled):
index="botsv1" sourcetype="xmlwineventlog:microsoft-windows-sysmon/operational" | stats values(CommandLine) by Computer,process. 


index="botsv1" sourcetype="xmlwineventlog:microsoft-windows-sysmon/operational" host=we8105desk  Computer="we8105desk.waynecorpinc.local" ParentCommandLine="\"C:\\Program Files (x86)\\Microsoft Office\\Office14\\WINWORD.EXE\" /n /f \"D:\\Miranda_Tate_unveiled.dotm\"" 
| eval len=len(CommandLine)
| table len



26. What is the name of the USB key inserted by Bob Smith?
https://community.splunk.com/t5/Splunk-Search/Finding-USB-and-Removable-Media-Detection/td-p/273918
index=botsv1 sourcetype=winregistry friendlyname | table host object data

27. Bob Smith's workstation (we8105desk) was connected to a file server during the ransomware outbreak. What is the IP address of the file server?
index="botsv1" host="we8105desk" dest_ip="192.168.250.20" check for destination ip and destination ports. Found SMB ports 139 and 445.

28. How many distinct PDFs did the ransomware encrypt on the remote file server?
index=botsv1 sourcetype=*win* pdf dest=we9041srv.waynecorpinc.local Source_Address=192.168.250.100 | stats dc(Relative_Target_Name)

29. The VBscript found in question 25 launches 121214.tmp. What is the ParentProcessId of this initial launch?
index=botsv1 sourcetype=XmlWinEventLog:Microsoft-Windows-Sysmon/Operational 121214.tmp CommandLine=* | table _time CommandLine ProcessId ParentProcessId ParentCommandLine | reverse

30. The Cerber ransomware encrypts files located in Bob Smith's Windows profile. How many .txt files does it encrypt?
index=botsv1 sourcetype=XmlWinEventLog:Microsoft-Windows-Sysmon/Operational host=we8105desk EventCode=2 TargetFilename="C:\\Users\\bob.smith.WAYNECORPINC\\*.txt" | stats dc(TargetFilename)

31. The malware downloads a file that contains the Cerber ransomware cryptor code. What is the name of that file?
index="botsv1" sourcetype="suricata" src_ip=192.168.250.100 event_type=http http.http_method=GET http.hostname=solidaritedeproximite.org
| stats count by url

32. Now that you know the name of the ransomware's encryptor file, what obfuscation technique does it likely use?
steganography

Bonus:

List all process execution activity and all executed commands
Leverage the available sysmon logs and construct two Splunk searches. One that will list all process execution activity and one that will list all executed commands.
Hint: The ParentImage and CommandLine fields will prove useful in this task.

index="botsv1" sourcetype="xmlwineventlog:microsoft-windows-sysmon/operational" | stats values(ParentImage) by process
index="botsv1" sourcetype="xmlwineventlog:microsoft-windows-sysmon/operational" | stats values(CommandLine) by Computer,process

Bonus 1: If you want to list all commands being executed by a specific (usually abused) process, you can do so as follows.
index="botsv1" sourcetype="xmlwineventlog:microsoft-windows-sysmon/operational" process=*cmd.exe | stats values(CommandLine) by Computer,process

Bonus 2:
If you want to identify, for example, the longest cmd.exe command that was executed (overly long commands are suspicious), you can do so as follows.
index="botsv1" sourcetype="xmlwineventlog:microsoft-windows-sysmon/operational" process=*cmd.exe | eval len=len(CommandLine) | table User, len, CommandLine | sort -len